jason3w/pyflash-web/Puya.PY32F0xx_DFP.1.2.8/Drivers/CMSIS/Device/PY32F0xx/Include/py32f002cx6.h
/********************************* Bit definition for ADC_DR2 register **********************************************/
#define ADC_DR2_SQ3_DATA_Pos                      (0U)
#define ADC_DR2_SQ3_DATA_Msk                      (0xFFFFUL<<ADC_DR2_SQ3_DATA_Pos)                  /*!< 0x0000FFFF */
#define ADC_DR2_SQ3_DATA                          ADC_DR2_SQ3_DATA_Msk
#define ADC_DR2_SQ4_DATA_Pos                      (16U)
#define ADC_DR2_SQ4_DATA_Msk                      (0xFFFFUL<<ADC_DR2_SQ4_DATA_Pos)                  /*!< 0xFFFF0000 */
#define ADC_DR2_SQ4_DATA                          ADC_DR2_SQ4_DATA_Msk

/********************************* Bit definition for ADC_DR3 register **********************************************/
#define ADC_DR3_SQ5_DATA_Pos                      (0U)
#define ADC_DR3_SQ5_DATA_Msk                      (0xFFFFUL<<ADC_DR3_SQ5_DATA_Pos)                  /*!< 0x0000FFFF */
#define ADC_DR3_SQ5_DATA                          ADC_DR3_SQ5_DATA_Msk
#define ADC_DR3_SQ6_DATA_Pos                      (16U)
#define ADC_DR3_SQ6_DATA_Msk                      (0xFFFFUL<<ADC_DR3_SQ6_DATA_Pos)                  /*!< 0xFFFF0000 */
#define ADC_DR3_SQ6_DATA                          ADC_DR3_SQ6_DATA_Msk

/********************************* Bit definition for ADC_DR4 register **********************************************/
#define ADC_DR4_SQ7_DATA_Pos                      (0U)
#define ADC_DR4_SQ7_DATA_Msk                      (0xFFFFUL<<ADC_DR4_SQ7_DATA_Pos)                  /*!< 0x0000FFFF */
#define ADC_DR4_SQ7_DATA                          ADC_DR4_SQ7_DATA_Msk
#define ADC_DR4_SQ8_DATA_Pos                      (16U)
#define ADC_DR4_SQ8_DATA_Msk                      (0xFFFFUL<<ADC_DR4_SQ8_DATA_Pos)                  /*!< 0xFFFF0000 */
#define ADC_DR4_SQ8_DATA                          ADC_DR4_SQ8_DATA_Msk

/********************************* Bit definition for ADC_DR5 register **********************************************/
#define ADC_DR5_SQ9_DATA_Pos                      (0U)
#define ADC_DR5_SQ9_DATA_Msk                      (0xFFFFUL<<ADC_DR5_SQ9_DATA_Pos)                  /*!< 0x0000FFFF */
#define ADC_DR5_SQ9_DATA                          ADC_DR5_SQ9_DATA_Msk
#define ADC_DR5_SQ10_DATA_Pos                     (16U)
#define ADC_DR5_SQ10_DATA_Msk                     (0xFFFFUL<<ADC_DR5_SQ10_DATA_Pos)                 /*!< 0xFFFF0000 */
#define ADC_DR5_SQ10_DATA                         ADC_DR5_SQ10_DATA_Msk

/********************************* Bit definition for ADC_DR6 register **********************************************/
#define ADC_DR6_SQ11_DATA_Pos                     (0U)
#define ADC_DR6_SQ11_DATA_Msk                     (0xFFFFUL<<ADC_DR6_SQ11_DATA_Pos)                 /*!< 0x0000FFFF */
#define ADC_DR6_SQ11_DATA                         ADC_DR6_SQ11_DATA_Msk
#define ADC_DR6_SQ12_DATA_Pos                     (16U)
#define ADC_DR6_SQ12_DATA_Msk                     (0xFFFFUL<<ADC_DR6_SQ12_DATA_Pos)                 /*!< 0xFFFF0000 */
#define ADC_DR6_SQ12_DATA                         ADC_DR6_SQ12_DATA_Msk

/********************************* Bit definition for ADC_DR7 register **********************************************/
#define ADC_DR7_SQ13_DATA_Pos                     (0U)
#define ADC_DR7_SQ13_DATA_Msk                     (0xFFFFUL<<ADC_DR7_SQ13_DATA_Pos)                 /*!< 0x0000FFFF */
#define ADC_DR7_SQ13_DATA                         ADC_DR7_SQ13_DATA_Msk
#define ADC_DR7_SQ14_DATA_Pos                     (16U)
#define ADC_DR7_SQ14_DATA_Msk                     (0xFFFFUL<<ADC_DR7_SQ14_DATA_Pos)                 /*!< 0xFFFF0000 */
#define ADC_DR7_SQ14_DATA                         ADC_DR7_SQ14_DATA_Msk

/********************************* Bit definition for ADC_CALFACT register ******************************************/
#define ADC_CALFACT_WCALFACT_Pos                  (0U)
#define ADC_CALFACT_WCALFACT_Msk                  (0x1FFUL<<ADC_CALFACT_WCALFACT_Pos)               /*!< 0x000001FF */
#define ADC_CALFACT_WCALFACT                      ADC_CALFACT_WCALFACT_Msk
#define ADC_CALFACT_FACTSEL_Pos                   (9U)
#define ADC_CALFACT_FACTSEL_Msk                   (0x1FUL<<ADC_CALFACT_FACTSEL_Pos)                 /*!< 0x00003E00 */
#define ADC_CALFACT_FACTSEL                       ADC_CALFACT_FACTSEL_Msk
#define ADC_CALFACT_FACTSEL_0                     (0x1UL<<ADC_CALFACT_FACTSEL_Pos)                  /*!< 0x00000200 */
#define ADC_CALFACT_FACTSEL_1                     (0x2UL<<ADC_CALFACT_FACTSEL_Pos)                  /*!< 0x00000400 */
#define ADC_CALFACT_FACTSEL_2                     (0x4UL<<ADC_CALFACT_FACTSEL_Pos)                  /*!< 0x00000800 */
#define ADC_CALFACT_FACTSEL_3                     (0x8UL<<ADC_CALFACT_FACTSEL_Pos)                  /*!< 0x00001000 */
#define ADC_CALFACT_FACTSEL_4                     (0x10UL<<ADC_CALFACT_FACTSEL_Pos)                 /*!< 0x00002000 */
#define ADC_CALFACT_WRVLD_Pos                     (14U)
#define ADC_CALFACT_WRVLD_Msk                     (0x1UL<<ADC_CALFACT_WRVLD_Pos)                    /*!< 0x00004000 */
#define ADC_CALFACT_WRVLD                         ADC_CALFACT_WRVLD_Msk                             
#define ADC_CALFACT_RDVLD_Pos                     (15U)
#define ADC_CALFACT_RDVLD_Msk                     (0x1UL<<ADC_CALFACT_RDVLD_Pos)                    /*!< 0x00008000 */
#define ADC_CALFACT_RDVLD                         ADC_CALFACT_RDVLD_Msk                             
#define ADC_CALFACT_OFFSUC_Pos                    (20U)
#define ADC_CALFACT_OFFSUC_Msk                    (0x1UL<<ADC_CALFACT_OFFSUC_Pos)                   /*!< 0x00100000 */
#define ADC_CALFACT_OFFSUC                        ADC_CALFACT_OFFSUC_Msk                            
#define ADC_CALFACT_CAPSUC_Pos                    (21U)
#define ADC_CALFACT_CAPSUC_Msk                    (0x1UL<<ADC_CALFACT_CAPSUC_Pos)                   /*!< 0x00200000 */
#define ADC_CALFACT_CAPSUC                        ADC_CALFACT_CAPSUC_Msk                            
#define ADC_CALFACT_RCALFACT_Pos                  (23U)
#define ADC_CALFACT_RCALFACT_Msk                  (0x1FFUL<<ADC_CALFACT_RCALFACT_Pos)               /*!< 0xFF800000 */
#define ADC_CALFACT_RCALFACT                      ADC_CALFACT_RCALFACT_Msk

