jason3w/pyflash-web/Puya.PY32F0xx_DFP.1.2.8/Drivers/CMSIS/Device/PY32F0xx/Include/py32f002cx6.h
/*******************  Bit definition for IWDG_PR register  ********************/
#define IWDG_PR_PR_Pos                  (0U)
#define IWDG_PR_PR_Msk                  (0x7UL << IWDG_PR_PR_Pos)          /*!< 0x00000007 */
#define IWDG_PR_PR                      IWDG_PR_PR_Msk                     /*!<PR[2:0] (Prescaler divider) */
#define IWDG_PR_PR_0                    (0x1UL << IWDG_PR_PR_Pos)          /*!< 0x00000001 */
#define IWDG_PR_PR_1                    (0x2UL << IWDG_PR_PR_Pos)          /*!< 0x00000002 */
#define IWDG_PR_PR_2                    (0x4UL << IWDG_PR_PR_Pos)          /*!< 0x00000004 */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define IWDG_RLR_RL_Pos                 (0U)
#define IWDG_RLR_RL_Msk                 (0xFFFUL << IWDG_RLR_RL_Pos)       /*!< 0x00000FFF */
#define IWDG_RLR_RL                     IWDG_RLR_RL_Msk                    /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ********************/
#define IWDG_SR_PVU_Pos                 (0U)
#define IWDG_SR_PVU_Msk                 (0x1UL << IWDG_SR_PVU_Pos)         /*!< 0x00000001 */
#define IWDG_SR_PVU                     IWDG_SR_PVU_Msk                    /*!< Watchdog prescaler value update */
#define IWDG_SR_RVU_Pos                 (1U)
#define IWDG_SR_RVU_Msk                 (0x1UL << IWDG_SR_RVU_Pos)         /*!< 0x00000002 */
#define IWDG_SR_RVU                     IWDG_SR_RVU_Msk                    /*!< Watchdog counter reload value update */

/********************************************************************************************************************/
/********************************* OPA ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for OPA_OCR register *********************************************/
#define OPA_OCR_OPA_EXTOEN_Pos                  (0U)
#define OPA_OCR_OPA_EXTOEN_Msk                  (0x1UL<<OPA_OCR_OPA_EXTOEN_Pos)                 /*!< 0x00000001 */
#define OPA_OCR_OPA_EXTOEN                      OPA_OCR_OPA_EXTOEN_Msk                          
#define OPA_OCR_OPA_VBIAS_Pos                    (3U)
#define OPA_OCR_OPA_VBIAS_Msk                    (0x3UL<<OPA_OCR_OPA_VBIAS_Pos)                   /*!< 0x00000018 */
#define OPA_OCR_OPA_VBIAS                        OPA_OCR_OPA_VBIAS_Msk
#define OPA_OCR_OPA_VBIAS_0                      (0x1UL<<OPA_OCR_OPA_VBIAS_Pos)                   /*!< 0x00000008 */
#define OPA_OCR_OPA_VBIAS_1                      (0x2UL<<OPA_OCR_OPA_VBIAS_Pos)                   /*!< 0x00000010 */
#define OPA_OCR_OPA_VMSEL_Pos                   (5U)
#define OPA_OCR_OPA_VMSEL_Msk                   (0x3UL<<OPA_OCR_OPA_VMSEL_Pos)                  /*!< 0x00000060 */
#define OPA_OCR_OPA_VMSEL                       OPA_OCR_OPA_VMSEL_Msk
#define OPA_OCR_OPA_VMSEL_0                     (0x1UL<<OPA_OCR_OPA_VMSEL_Pos)                  /*!< 0x00000020 */
#define OPA_OCR_OPA_VMSEL_1                     (0x2UL<<OPA_OCR_OPA_VMSEL_Pos)                  /*!< 0x00000040 */
#define OPA_OCR_OPA_VBSEL_Pos                   (7U)
#define OPA_OCR_OPA_VBSEL_Msk                   (0x1UL<<OPA_OCR_OPA_VBSEL_Pos)                  /*!< 0x00000080 */
#define OPA_OCR_OPA_VBSEL                       OPA_OCR_OPA_VBSEL_Msk                           
#define OPA_OCR_OPA_PGA_GAIN_Pos                (8U)
#define OPA_OCR_OPA_PGA_GAIN_Msk                (0xFUL<<OPA_OCR_OPA_PGA_GAIN_Pos)               /*!< 0x00000F00 */
#define OPA_OCR_OPA_PGA_GAIN                    OPA_OCR_OPA_PGA_GAIN_Msk
#define OPA_OCR_OPA_PGA_GAIN_0                  (0x1UL<<OPA_OCR_OPA_PGA_GAIN_Pos)               /*!< 0x00000100 */
#define OPA_OCR_OPA_PGA_GAIN_1                  (0x2UL<<OPA_OCR_OPA_PGA_GAIN_Pos)               /*!< 0x00000200 */
#define OPA_OCR_OPA_PGA_GAIN_2                  (0x4UL<<OPA_OCR_OPA_PGA_GAIN_Pos)               /*!< 0x00000400 */
#define OPA_OCR_OPA_PGA_GAIN_3                  (0x8UL<<OPA_OCR_OPA_PGA_GAIN_Pos)               /*!< 0x00000800 */

/********************************* Bit definition for OPA_CR register **********************************************/
#define OPA_CR_OPAEN_Pos                        (5U)
#define OPA_CR_OPAEN_Msk                        (0x1UL<<OPA_CR_OPAEN_Pos)                       /*!< 0x00000020 */
#define OPA_CR_OPAEN                            OPA_CR_OPAEN_Msk                                

/******************************************************************************/
/*                                                                            */
/*                        Power Control (PWR)                                 */
/*                                                                            */
/******************************************************************************/

/********************************* Bit definition for PWR_CR1 register **********************************************/
#define PWR_CR1_FLS_SLPTIME_Pos                   (12U)
#define PWR_CR1_FLS_SLPTIME_Msk                   (0x3UL<<PWR_CR1_FLS_SLPTIME_Pos)                  /*!< 0x00003000 */
#define PWR_CR1_FLS_SLPTIME                       PWR_CR1_FLS_SLPTIME_Msk
#define PWR_CR1_FLS_SLPTIME_0                     (0x1UL<<PWR_CR1_FLS_SLPTIME_Pos)                  /*!< 0x00001000 */
#define PWR_CR1_FLS_SLPTIME_1                     (0x2UL<<PWR_CR1_FLS_SLPTIME_Pos)                  /*!< 0x00002000 */
#define PWR_CR1_LPR_Pos                           (14U)
#define PWR_CR1_LPR_Msk                           (0x3UL<<PWR_CR1_LPR_Pos)                          /*!< 0x0000C000 */
#define PWR_CR1_LPR                               PWR_CR1_LPR_Msk
#define PWR_CR1_LPR_0                             (0x1UL<<PWR_CR1_LPR_Pos)                          /*!< 0x00004000 */
#define PWR_CR1_LPR_1                             (0x2UL<<PWR_CR1_LPR_Pos)                          /*!< 0x00008000 */
#define PWR_CR1_MR_VSEL_Pos                       (16U)
#define PWR_CR1_MR_VSEL_Msk                       (0x3UL<<PWR_CR1_MR_VSEL_Pos)                      /*!< 0x00030000 */
#define PWR_CR1_MR_VSEL                           PWR_CR1_MR_VSEL_Msk
#define PWR_CR1_MR_VSEL_0                         (0x1UL<<PWR_CR1_MR_VSEL_Pos)                      /*!< 0x00010000 */
#define PWR_CR1_MR_VSEL_1                         (0x2UL<<PWR_CR1_MR_VSEL_Pos)                      /*!< 0x00020000 */
#define PWR_CR1_LPR_VSEL_Pos                      (18U)
#define PWR_CR1_LPR_VSEL_Msk                      (0x3UL<<PWR_CR1_LPR_VSEL_Pos)                     /*!< 0x000C0000 */
#define PWR_CR1_LPR_VSEL                          PWR_CR1_LPR_VSEL_Msk
#define PWR_CR1_LPR_VSEL_0                        (0x1UL<<PWR_CR1_LPR_VSEL_Pos)                     /*!< 0x00040000 */
#define PWR_CR1_LPR_VSEL_1                        (0x2UL<<PWR_CR1_LPR_VSEL_Pos)                     /*!< 0x00080000 */
#define PWR_CR1_DLPR_VSEL_Pos                     (20U)
#define PWR_CR1_DLPR_VSEL_Msk                     (0x3UL<<PWR_CR1_DLPR_VSEL_Pos)                    /*!< 0x00300000 */
#define PWR_CR1_DLPR_VSEL                         PWR_CR1_DLPR_VSEL_Msk
#define PWR_CR1_DLPR_VSEL_0                       (0x1UL<<PWR_CR1_DLPR_VSEL_Pos)                    /*!< 0x00100000 */
#define PWR_CR1_DLPR_VSEL_1                       (0x2UL<<PWR_CR1_DLPR_VSEL_Pos)                    /*!< 0x00200000 */
#define PWR_CR1_HSION_CTRL_Pos                    (22U)
#define PWR_CR1_HSION_CTRL_Msk                    (0x1UL<<PWR_CR1_HSION_CTRL_Pos)                   /*!< 0x00400000 */
#define PWR_CR1_HSION_CTRL                        PWR_CR1_HSION_CTRL_Msk                            

/********************************* Bit definition for PWR_CR2 register **********************************************/
#define PWR_CR2_PVDE_Pos                          (0U)
#define PWR_CR2_PVDE_Msk                          (0x1UL<<PWR_CR2_PVDE_Pos)                         /*!< 0x00000001 */
#define PWR_CR2_PVDE                              PWR_CR2_PVDE_Msk                                  
#define PWR_CR2_PVDT_Pos                          (4U)
#define PWR_CR2_PVDT_Msk                          (0x7UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000070 */
#define PWR_CR2_PVDT                              PWR_CR2_PVDT_Msk
#define PWR_CR2_PVDT_0                            (0x1UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000010 */
#define PWR_CR2_PVDT_1                            (0x2UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000020 */
#define PWR_CR2_PVDT_2                            (0x4UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000040 */
#define PWR_CR2_FLTEN_Pos                         (8U)
#define PWR_CR2_FLTEN_Msk                         (0x1UL<<PWR_CR2_FLTEN_Pos)                        /*!< 0x00000100 */
#define PWR_CR2_FLTEN                             PWR_CR2_FLTEN_Msk                                 
#define PWR_CR2_FLT_TIME_Pos                      (9U)
#define PWR_CR2_FLT_TIME_Msk                      (0x7UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000E00 */
#define PWR_CR2_FLT_TIME                          PWR_CR2_FLT_TIME_Msk
#define PWR_CR2_FLT_TIME_0                        (0x1UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000200 */
#define PWR_CR2_FLT_TIME_1                        (0x2UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000400 */
#define PWR_CR2_FLT_TIME_2                        (0x4UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000800 */

/********************************* Bit definition for PWR_SR register ***********************************************/
#define PWR_SR_PVDO_Pos                           (11U)
#define PWR_SR_PVDO_Msk                           (0x1UL<<PWR_SR_PVDO_Pos)                          /*!< 0x00000800 */
#define PWR_SR_PVDO                               PWR_SR_PVDO_Msk                                   

/******************************************************************************/
/*                                                                            */
/*                           Reset and Clock Control (RCC)                    */
/*                                                                            */
/******************************************************************************/
/*
* @brief Specific device feature definitions
*/
#define RCC_LSE_SUPPORT
#define RCC_HSE_SUPPORT

/********************  Bit definition for RCC_CR register  *****************/
#define RCC_CR_HSION_Pos                (8U)
#define RCC_CR_HSION_Msk                (0x1UL << RCC_CR_HSION_Pos)                 /*!< 0x00000100 */
#define RCC_CR_HSION                    RCC_CR_HSION_Msk                            /*!< HSI clock enable bit */
#define RCC_CR_HSIRDY_Pos               (10U)
#define RCC_CR_HSIRDY_Msk               (0x1UL << RCC_CR_HSIRDY_Pos)                /*!< 0x00000400 */
#define RCC_CR_HSIRDY                   RCC_CR_HSIRDY_Msk                           /*!< HSI clock ready logo */
#define RCC_CR_HSIDIV_Pos               (11U)
#define RCC_CR_HSIDIV_Msk               (0x7UL << RCC_CR_HSIDIV_Pos)                /*!< 0x00003800 */
#define RCC_CR_HSIDIV                   RCC_CR_HSIDIV_Msk                           /*!< HSI generates the crossover factor when HSISYS clocks */
#define RCC_CR_HSIDIV_0                 (0x1UL << RCC_CR_HSIDIV_Pos)                /*!< 0x00000800 */
#define RCC_CR_HSIDIV_1                 (0x2UL << RCC_CR_HSIDIV_Pos)                /*!< 0x00001000 */
#define RCC_CR_HSIDIV_2                 (0x4UL << RCC_CR_HSIDIV_Pos)                /*!< 0x00002000 */
#define RCC_CR_HSEON_Pos                (16U)
#define RCC_CR_HSEON_Msk                (0x1UL << RCC_CR_HSEON_Pos)                 /*!< 0x00010000 */
#define RCC_CR_HSEON                    RCC_CR_HSEON_Msk
#define RCC_CR_HSERDY_Pos               (17U)
#define RCC_CR_HSERDY_Msk               (0x1UL << RCC_CR_HSERDY_Pos)                /*!< 0x00020000 */
#define RCC_CR_HSERDY                   RCC_CR_HSERDY_Msk
#define RCC_CR_HSEBYP_Pos               (18U)
#define RCC_CR_HSEBYP_Msk               (0x1UL << RCC_CR_HSEBYP_Pos)                /*!< 0x00040000 */
#define RCC_CR_HSEBYP                   RCC_CR_HSEBYP_Msk
#define RCC_CR_HSE_CSSON_Pos            (19U)
#define RCC_CR_HSE_CSSON_Msk            (0x1UL << RCC_CR_HSE_CSSON_Pos)             /*!< 0x00080000 */
#define RCC_CR_HSE_CSSON                RCC_CR_HSE_CSSON_Msk

/********************  Bit definition for RCC_ICSCR register  ***************/
#define RCC_ICSCR_HSI_ABS_TRIMCR_Pos    (0U)
#define RCC_ICSCR_HSI_ABS_TRIMCR_Msk    (0xFFFUL << RCC_ICSCR_HSI_ABS_TRIMCR_Pos)   /*!< 0x00000FFF */
#define RCC_ICSCR_HSI_ABS_TRIMCR        RCC_ICSCR_HSI_ABS_TRIMCR_Msk                /*!< HSITRIM[11:0] bits */
#define RCC_ICSCR_HSI_ABS_TRIMCR_0      (0x01UL << RCC_ICSCR_HSI_TRIM_Pos)          /*!< 0x00000001 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_1      (0x02UL << RCC_ICSCR_HSI_TRIM_Pos)          /*!< 0x00000002 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_2      (0x04UL << RCC_ICSCR_HSI_TRIM_Pos)          /*!< 0x00000004 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_3      (0x08UL << RCC_ICSCR_HSI_TRIM_Pos)          /*!< 0x00000008 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_4      (0x10UL << RCC_ICSCR_HSI_TRIM_Pos)          /*!< 0x00000010 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_5      (0x20UL << RCC_ICSCR_HSI_TRIM_Pos)          /*!< 0x00000020 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_6      (0x40UL << RCC_ICSCR_HSI_TRIM_Pos)          /*!< 0x00000040 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_7      (0x80UL << RCC_ICSCR_HSI_TRIM_Pos)          /*!< 0x00000080 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_8      (0x100UL << RCC_ICSCR_HSI_TRIM_Pos)         /*!< 0x00000100 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_9      (0x200UL << RCC_ICSCR_HSI_TRIM_Pos)         /*!< 0x00000200 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_10     (0x400UL << RCC_ICSCR_HSI_TRIM_Pos)         /*!< 0x00000400 */
#define RCC_ICSCR_HSI_ABS_TRIMCR_11     (0x800UL << RCC_ICSCR_HSI_TRIM_Pos)         /*!< 0x00000800 */
#define RCC_ICSCR_HSI_TC_TRIMCR_Pos     (12U)                                     
#define RCC_ICSCR_HSI_TC_TRIMCR_Msk     (0xFUL << RCC_ICSCR_HSI_TC_TRIMCR_Pos)      /*!< 0x0000F000 */
#define RCC_ICSCR_HSI_TC_TRIMCR         RCC_ICSCR_HSI_TC_TRIMCR_Msk                 /*!< HSIFS[15:12] bits */
#define RCC_ICSCR_HSI_TC_TRIMCR_0       (0x01UL << RCC_ICSCR_HSI_TC_TRIMCR_Pos)     /*!< 0x00001000 */
#define RCC_ICSCR_HSI_TC_TRIMCR_1       (0x02UL << RCC_ICSCR_HSI_TC_TRIMCR_Pos)     /*!< 0x00002000 */
#define RCC_ICSCR_HSI_TC_TRIMCR_2       (0x04UL << RCC_ICSCR_HSI_TC_TRIMCR_Pos)     /*!< 0x00004000 */
#define RCC_ICSCR_HSI_TC_TRIMCR_3       (0x04UL << RCC_ICSCR_HSI_TC_TRIMCR_Pos)     /*!< 0x00008000 */
#define RCC_ICSCR_HSI_FS_Pos            (16U)
#define RCC_ICSCR_HSI_FS_Msk            (0x3UL << RCC_ICSCR_HSI_FS_Pos)
#define RCC_ICSCR_HSI_FS                RCC_ICSCR_HSI_FS_Msk
#define RCC_ICSCR_HSI_FS_0              (0x01UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_HSI_FS_1              (0x02UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_Pos          (19U)
#define RCC_ICSCR_LSI_TRIM_Msk          (0x1FFUL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM              RCC_ICSCR_LSI_TRIM_Msk
#define RCC_ICSCR_LSI_TRIM_0            (0x01UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_1            (0x02UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_2            (0x04UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_3            (0x08UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_4            (0x10UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_5            (0x20UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_6            (0x40UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_7            (0x80UL << RCC_ICSCR_LSI_TRIM_Pos)
#define RCC_ICSCR_LSI_TRIM_8            (0x100UL << RCC_ICSCR_LSI_TRIM_Pos)

/********************  Bit definition for RCC_CFGR register  ***************/
/*!< SW configuration */
#define RCC_CFGR_SW_Pos                 (0U)
#define RCC_CFGR_SW_Msk                 (0x7UL << RCC_CFGR_SW_Pos)             /*!< 0x00000007 */
#define RCC_CFGR_SW                     RCC_CFGR_SW_Msk                        /*!< SW[2:0] bits (System clock Switch) */
#define RCC_CFGR_SW_0                   (0x1UL << RCC_CFGR_SW_Pos)             /*!< 0x00000001 */
#define RCC_CFGR_SW_1                   (0x2UL << RCC_CFGR_SW_Pos)             /*!< 0x00000002 */
#define RCC_CFGR_SW_2                   (0x4UL << RCC_CFGR_SW_Pos)             /*!< 0x00000004 */

